
{
  "title": "Mecha BREAK— Blitz, Brawl, Blaze!",
  "url": "https://mechabreak.seasungames.com/index/en/#/news-article/1017/383",
  "tag_name": "p",
  "elements": [
    "Dear Pilots,",
    "Welcome to S.H.A.D.O.W. (Strategic Hazard Assessment and Defense Operations and Watch). Below is the operational information for this test. Please review it carefully.",
    "Please note that since this test operation is an unrecorded exercise, all related data will be erased after the operation ends. There may also be differences compared to official operations. Please be aware of this.",
    "#Basic Information#",
    "Operation Code: \"Global Storm\"",
    "Confidentiality Level: Public",
    "Operational Personnel: All S.H.A.D.O.W. pilots",
    "Start Time: February 23, 18:00 (GMT+8)",
    "Operation Time: Open all day",
    "Operation Voice: Chinese/Japanese/English",
    "Operation Language: Simplified Chinese/English/Japanese/Spanish/Portuguese/German/French/Russian/Korean/Traditional Chinese/Thai",
    "End Time: To be notified later",
    "#Event Information#",
    "[Steam Wishlist]",
    "· During the \"Global Storm\" test, pilots can jump to the Steam store page of *Mecha BREAK* through the in-game event page. After adding *Mecha BREAK* to your wishlist, return to the game to claim the exclusive \"Global Storm\" test pilot hat accessory [Flame Memorial].",
    "—— [Flame Memorial] is a limited-time reward for the \"Global Storm\" test on the Steam platform. Pilots who claim [Flame Memorial] during the test can inherit this accessory to their Steam account in the same server during the official release.",
    "[Final Preparation Operation]",
    "· During the \"Global Storm\" test, pilots participating in Mashmak mode battles have a chance to obtain the limited-time loot [Final Preparation Box]. By transporting it via rocket or successfully evacuating from Mashmak, pilots can obtain the [Final Preparation Box].",
    "—— Opening the [Final Preparation Box] grants random amounts of crystal rewards and a chance to obtain rare drops, such as a 1:72 scale model of the UBP-R02T Falcon (Exquisite Grade, Unlocked Mech, Movable Alloy Coating).",
    "—— Pilots who obtain the [Falcon Model Voucher] must register and exchange it for the physical 1:72 scale Falcon model before the end of the \"Global Storm\" test by contacting customer support in-game.",
    "[Ace Path]",
    "· To help pilots adapt to combat environments faster, S.H.A.D.O.W. has prepared the Ace Path training program. Pilots can earn rich credit rewards, pilot outfits, and accessories by logging in daily and completing specific mission objectives.",
    "[Special Tactical Support]",
    "· During the \"Global Storm\" test, [Special Tactical Support] will be automatically activated. Pilots can enjoy benefits such as [Large Transport Rocket Rights], expanded weekly merit limits, reduced beacon costs, and the ability to mail items in Mashmak mode.",
    "[Binding Supplies]",
    "· To ensure account security and provide additional protection, S.H.A.D.O.W. will distribute [Network Supply Box Type I] rewards to pilots who successfully bind their email on the event page.",
    "#Briefing Information#",
    "[New Storyline: Mashmak Rescue Operation]",
    "· S.H.A.D.O.W. has detected recent activities of the Teya Front in the Mashmak region. Recon mechs sent to the area have lost contact. Pilots must pilot the [PGI-X30G1 Longyuan] to infiltrate Mashmak, conduct rescue operations, and confirm the true intentions of the Teya Front.",
    "[Mechs]",
    "· S.H.A.D.O.W. has approved 13 unique unlocked mechs for this operation, each with different tactical roles. Pilots can unlock them through research or exchange them using mission merit coins.",
    "· Based on combat data from previous exercises, S.H.A.D.O.W. has adjusted the armament configurations and combat values of some unlocked mechs. Please stay updated on the latest armament information and mech combat values.",
    "[Battlefield Sandbox]",
    "· This operation will directly authorize pilots to participate in [6v6 Edge Battlefield] and [Mashmak Multiplayer Mode]. Pilots can freely choose regions to engage in combat.",
    "· By accumulating achievement points, pilots can unlock advanced modes such as [3v3 Ace Sequence], [Mashmak Solo Mode], and [Online Battle] upon reaching certain achievement levels.",
    "· The [Recruitment] function in the hangar lobby and the [Preset Mech] function in matching modes will help pilots form squads and participate in battles.",
    "[Mashmak]",
    "· According to the latest intelligence, the Teya Front is attempting to use EIC pulse storms to create a larger global disaster! S.H.A.D.O.W. will dispatch unlocked mechs to Mashmak to eliminate enemy strongholds and recover strategic resources within a specified time.",
    "—— To stop the Teya Front's plot, Mashmak has gathered unidentified squads from various regions. Pilots must avoid threats from EIC pulse storms and other unknown squads while clearing strongholds and evacuating.",
    "[Advanced Challenges]",
    "· To help pilots familiarize themselves with new mechs, S.H.A.D.O.W. has prepared basic and advanced challenge missions for all mechs, in addition to the existing basic tutorial mission [Test Pilot].",
    "[Credit System]",
    "· To maintain discipline, S.H.A.D.O.W. will monitor and penalize negative behavior, violations, and other misconduct in season and casual match modes. Pilots with low credit scores will be unable to participate in season match modes.",
    "—— Credit scores are shared across all match modes. Pilots can check their credit scores in the personal center and review related rules.",
    "[Components]",
    "· The component system is now live. Pilots can equip [Components] to balance mech handling. While enhancing one combat value, components may reduce another value in the same category (e.g., structure, energy, fluid armor, mobility, fire control, armament, stability).",
    "[Pilots]",
    "· Pilots can customize their appearance when choosing their faction identity. With upgrades to hangar medical technology, pilots can further customize their outfits, accessories, appearance, hairstyle, and body shape to create a unique personal image.",
    "[Skins]",
    "· A new skin system is now available. Pilots can collect paints, patterns, and emblems to customize the appearance of each mech. By obtaining multiple special armament blueprints, pilots can unlock unique mech and armament designs.",
    "[Hangar]",
    "· The hangar inspection function is now open. Pilots can explore various work and living areas in the hangar from a third-person perspective, experiencing the grandeur of unlocked mechs and armaments.",
    "—— S.H.A.D.O.W. is still preparing and improving the hangar. More functional areas and facilities will be unlocked in the future.",
    "#Mech Data#",
    "[PGI-X30G1 Longyuan]",
    "· Medium attack mech, capable of switching between [Energy Cannon] and [Halberd Weapon] for mid-to-close-range combat. Its tactical armor-shedding function allows it to discard outer armor when heavily damaged, then call for an airdrop to re-equip additional armor and armaments.",
    "[UBP-R02T Falcon]",
    "· Light attack mech, capable of transforming into [Falcon Form] to rapidly enter the battlefield and unleash [Light Missiles] and [Heavy Missiles] to gain air superiority. It also has excellent reconnaissance and anti-stealth capabilities to suppress enemy sniper mechs.",
    "[SLM-M324C Triceratops]",
    "· Super-heavy defense mech, capable of transforming into [Fortress Form] to automatically deploy a shield that defends against all-directional attacks. It can also use accompanying drones to intercept missiles and deploy [Repair Drones] to heal nearby allies.",
    "[KMA-D201 Thunder God]",
    "· Light sniper mech, skilled at using [Decoy Drones], [Anchor Claw], and [Optical Camouflage Drones] to hide its location. It can deliver unexpected lethal strikes with its long-range [Charged Beam Cannon].",
    "[PGI-T02 Red Sky]",
    "· Heavy melee mech, capable of using [Duel Field], [Smoke Disperser], and [Defense Field] to tear through enemy lines. It can lead allies in a charge and wield a [Heavy Battle Axe] to deliver devastating blows.",
    "[NGL-XR30 Lumina]",
    "· Light support mech, capable of using [Drone Launcher] to repair multiple allied mechs simultaneously. It can also deploy [Smoke Dispensers] and [Support Thrusters] to provide frontline support or switch to [Erosion Form] to lock onto and attack enemy units.",
    "[SLM-M144 Hurricane]",
    "· Super-heavy defense mech, capable of deploying [Decoy Drones], [Defense Field Drones], and [Turret Drones] to create a strong defensive position, providing cover and a safe long-range attack environment for allies.",
    "[MHI-XT31 Binaka]",
    "· Medium support mech, capable of using [Quick Repair Modules] and deploying [Repair Drones] and [Emergency Support Drones] to heal allies. It can also call in airdrops of large barriers to block attacks and hinder enemy movement, creating a favorable combat environment.",
    "[NGS-X237A Aquina]",
    "· Heavy sniper mech, capable of sustained hovering to snipe enemies from beyond their range using [Mobile Beam Cannon]. It can also use [Pulse Claw] and [Multi-Lock Radar] to quickly control and continuously attack targets.",
    "[NGS-Y244E Sky Striker]",
    "· Medium attack mech, capable of transforming into [Sky Strike Form] to enter the battlefield from the air. It can fire [Energy Blast Missiles], [Missile Dispensers], and [Energy Cannon] to suppress ground targets, and use [Disruption Missiles] to evade enemy pursuit.",
    "[SLM-M334F Stegosaurus]",
    "· Super-heavy attack mech, capable of transforming into [Turret Form] to significantly increase lock-on range and area. It can use [Rocket Launcher], [Rapid-Fire Rocket Launcher], and [Micro Missiles] to carpet-bomb enemy positions.",
    "[UBP-A04S Black Panther]",
    "· Medium melee mech, benefiting from excellent defense provided by [Melee Shield], [Additional Shield], and [Shield Charger]. It can use [Lance] and [Shield Blade] to navigate through enemy lines and take down key targets.",
    "[SLM-M143 Hellfire]",
    "· Super-heavy attack mech, capable of using powerful energy weapons such as [Charged Split Cannon], [Split Beam Cannon], and [Converged Beam Cannon] to suppress groups of enemies. It can also charge both hands with split cannons to deliver devastating piercing damage.",
    "#Mashmak#",
    "Unlock Level: Pilot Achievement Level 2, Solo Mode Level 13",
    "Battle Scenario: [Mashmak]",
    "Operation Rules: This operation requires reducing the Teya Front's forces in Mashmak and destroying the ground fracturing machine as much as possible. After reaching the specified time, pilots must head to the evacuation point. Missing the timing will require finding another evacuation opportunity, during which pilots will face threats from pulse storms and other squads.",
    "[Support Devices]",
    "· S.H.A.D.O.W. will automatically equip deployed mechs with airdropped [Beacon], [Repair Station Beacon], and [Rocket Transport Beacon] to call allies back to the battlefield (in solo mode, this calls the pilot themselves), airdrop repair stations, and transport resources via rockets.",
    "· Pilots can use [General Research Data] obtained in Mashmak to unlock [Recon Beacon] and [Decoy Beacon], and upgrade all support beacons (except rocket beacons) and change their colors.",
    "· Available support devices: [Large Rocket Beacon], [Repair Station Beacon], [Recon Beacon], [Beacon], [Decoy Beacon], [Armed Cargo Beacon].",
    "[General Armaments]",
    "· By using [Armed Cargo Beacon] to airdrop general armaments, pilots can equip various armaments with different effects to assist in Mashmak battles.",
    "· Pilots can obtain additional ammunition for [General Armaments] by looting or picking up ammo crates in Mashmak, and may directly pick up armaments dropped by elite guards.",
    "· [General Armaments] can be unlocked and upgraded using corresponding research data to increase damage and magazine capacity.",
    "· Available general armaments: [Rapid-Fire Cannon], [Gatling Cannon], [Heavy Sniper Cannon], [Beam Cannon], [Split Beam Cannon], [Charged Beam Cannon], [Charged Blast Cannon], [Dual Rocket Launcher], [Heavy Grenade Launcher], [Light Missile Launcher], [Melee Shield], [Smoke Disperser], [Thermal Sword].",
    "[Flight Pedals]",
    "· By using corresponding research data to unlock [Pedal Kits], pilots can equip [Vehicle Pedals] to form flight pedals and add them to airdrop configurations to assist in combat.",
    "· When using flight pedals, pilots can hover and move without consuming energy. Accelerating only consumes the pedal's own propulsion energy.",
    "· While on the pedals, pilots cannot use any weapons, including general armaments and mech armaments. Only the pedal kit's armaments can be used.",
    "· [Vehicle Pedals] can be upgraded using corresponding research data to improve mobility. [Pedal Kits] can be unlocked and upgraded to enhance their effects.",
    "· Available pedal kits: [Restraint Kit], [Sniper Kit], [Support Kit], [Melee Kit], [Assist Kit].",
    "#Edge Battlefield#",
    "Unlock Level: Pilot Achievement Level 2, same for casual match mode",
    "Battle Scenarios: [Kraob Crater], [Brown Cape Observatory], [Mith's Eye], [Pinwan Shipping Center], [Grasilin Sky City]",
    "Operation Rules: Two teams of 6 mechs each enter the battlefield. The first team to complete the specified objectives or lead when the operation ends wins. When a mech is destroyed, pilots can wait for the cooldown to end and manually deploy a new mech to re-enter the battle.",
    "[Kraob Crater]",
    "· Squads must capture and hold three data nodes to gain control of the crater. The first team to complete data recovery or lead when the operation ends wins.",
    "[Brown Cape Observatory]",
    "· Squads must dismantle ground fracturing machines deployed in the area. If not dismantled in time, the machines will activate automatically. The first team to dismantle the specified number wins.",
    "[Mith's Eye]",
    "· Squads must obtain launch keys from three data terminals and upload them to the central launch field's command pod. The first team to complete the upload or lead when the operation ends wins.",
    "[Pinwan Shipping Center] (formerly Mercury Shipyard)",
    "· Squads must guide a transport vehicle along a specified path to the central workshop. Activating three signal control points along the way helps the vehicle move faster. The first team to reach the central workshop wins.",
    "[Grasilin Sky City]",
    "· Squads must destroy enemy mechs in 3 rounds. During the battle, repair devices can support allies. The first team to destroy 6 enemy mechs wins the round. The first team to win 2 rounds wins the match.",
    "#Ace Sequence#",
    "Unlock Level: Pilot Achievement Level 16, same for casual match mode",
    "Battle Scenarios: [Pioneer], [West Ridge Lift City], [Ottantis Industrial Zone], [Data Matrix]",
    "Operation Rules: Two teams of 3 mechs each enter the battlefield. The first team to achieve 8 kills or lead when the operation ends wins. When a mech is destroyed, the Ace Sequence system will automatically generate and deploy a new mech for the pilot.",
    "This concludes all the information for the \"Global Storm\" test operation. Please read it carefully and prepare for the operation.",
    "—— S.H.A.D.O.W. Management Team",
    "Copyright © 2025 Amazing Seasun Games. All rights reserved."
  ],
  "count": 120
}
